{"_id":{"$oid":"622218f6845b318bf72ce24b"},"Title":"A Clockwork Orange","Description":"In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned. Things then go wrong.","Genre":{"Name":"Crime","Description":"Crime film is a genre that revolves around the action of a criminal mastermind. A Crime film will often revolve around the criminal himself, chronicling his rise and fall."},"Director":{"Name":"Stanley Kubrick","Bio":"Famed filmmaker Stanley Kubrick was born in New York City on July 26, 1928, and grew up in the Bronx, New York, where his father, Jacques Kubrick, worked as a doctor and his mother, Sadie (Perveler) Kubrick, was a housewife. He had a younger sister, Barbara. Kubrick never took to the classroom.","Birth":"1928","Death":"1999"},"ImagePath":"aclockworkorange.png","Featured":true}
{"_id":{"$oid":"6222323a92eeb4ddf39a2284"},"Title":"Dancer in the Dark","Description":"An Eastern European US immigrant with a love for musicals has to cope with the gradual loss of her vision.","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs by the characters are interwoven into the narrative, sometimes accompanied by singing and dancing. The songs usually advance the plot or develop the film's characters, but in some cases, they serve merely as breaks in the storyline, often as elaborate production numbers"},"Director":{"Name":"Lars von Trier","Bio":"Lars von Trier is a troubled director talking in his movies about troubled topics.","Birth":"1956"},"ImagePath":"dancerinthedark.png","Featured":true}
{"_id":{"$oid":"622232cc92eeb4ddf39a2285"},"Title":"Wild at Heart","Description":"Young lovers Sailor and Lula run from the variety of weirdos that Lula's mom has hired to kill Sailor.","Genre":{"Name":"Comedy","Description":"Comedy films are films designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment."},"Director":{"Name":"David Lynch","Bio":"David Lynch, in full David Keith Lynch, (born January 20, 1946, Missoula, Montana, U.S.), American filmmaker and screenwriter who was known for his uniquely disturbing and mind-bending visual work. His films juxtapose the cheerfully mundane with the shockingly macabre and often defy explanation.","Birth":"1946"},"ImagePath":"wildatheart.png","Featured":true}
{"_id":{"$oid":"622232dd92eeb4ddf39a2286"},"Title":"Pulp Fiction","Description":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Genre":{"Name":"Crime","Description":"Crime film is a genre that revolves around the action of a criminal mastermind. A Crime film will often revolve around the criminal himself, chronicling his rise and fall."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Tarantino was born on March 27, 1963, in Knoxville, Tennessee. He is the only child of Connie McHugh, who is part Cherokee and part Irish, and actor Tony Tarantino, who left the family before Quentin was born. Moving to California at the age of 4, Tarantino developed his love for movies at an early age.","Birth":"1963"},"ImagePath":"pulpfiction.png","Featured":true}
{"_id":{"$oid":"622232eb92eeb4ddf39a2287"},"Title":"Claire's Knee","Description":"On lakeside summer holiday, a conflicted older man is dared to have a flirt with two beautiful teenage stepsisters despite his betrothal to a diplomat's daughter and the fact that the girls have boyfriends.","Genre":{"Name":"Romance","Description":"Romance films or romance movies are romantic love stories recorded in visual media for broadcast in theaters and on television that focus on passion, emotion, and the affectionate romantic involvement of the main characters and the journey that their love takes them through dating, courtship or marriage."},"Director":{"Name":"Eric Rohmer","Bio":"Eric Rohmer, original name Jean-Marie Maurice Schérer or Maurice Henri Joseph Schérer, (born April 4, 1920?, Tulle?, France—died January 11, 2010, Paris), French motion-picture director and writer who was noted for his sensitively observed studies of romantic passion.","Birth":"1920"},"ImagePath":"clairesknee.png","Featured":true}
{"_id":{"$oid":"622232f592eeb4ddf39a2288"},"Title":"Fantastic Planet","Description":"A weird gang of beautifully drawn alien creatures try to understand why those little humans they pet want to rebel.","Genre":{"Name":"Animation","Description":"Animated Films are ones in which individual drawings, paintings, or illustrations are photographed frame by frame (stop-frame cinematography). Usually, each frame differs slightly from the one preceding it, giving the illusion of movement when frames are projected in rapid succession at 24 frames per second."},"Director":{"Name":"René Laloux","Bio":"René Laloux was born on July 13, 1929 in Paris, France. He was a writer and director, known for La Planète sauvage (1973), Les maîtres du temps (1982) and Les escargots (1966). He died on March 14, 2004 in Angoulême, Charente, France.","Birth":"1929"},"ImagePath":"fantasticplanet.png","Featured":true}
{"_id":{"$oid":"622234338d00cadc928df9bc"},"Title":"Cheatin","Description":"In a fateful bumper car collision, Jake and Ella meet and become the most loving couple in the long history of romance. But when a scheming other woman drives a wedge of jealousy into their perfect courtship, insecurity and hatred spell out an untimely fate. With only the help of a disgraced magician and his forbidden soul machine, Ella takes the form of Jake's numerous lovers, desperately fighting through the malfunction and deceit as they try to reclaim their destiny.","Genre":{"Name":"Animation","Description":"Animated Films are ones in which individual drawings, paintings, or illustrations are photographed frame by frame (stop-frame cinematography). Usually, each frame differs slightly from the one preceding it, giving the illusion of movement when frames are projected in rapid succession at 24 frames per second."},"Director":{"Name":"Bill Plympton","Bio":"Bill Plympton (born April 30, 1946) is an American animator, graphic designer, cartoonist, and filmmaker best known for his 1987 Academy Awards-nominated animated short Your Face and his series of shorts featuring a dog character starting with 2004's Guard Dog.","Birth":"1946"},"ImagePath":"cheatin.png","Featured":true}
{"_id":{"$oid":"622234888d00cadc928df9bd"},"Title":"Do the Right Thing","Description":"On the hottest day of the year on a street in the Bedford-Stuyvesant section of Brooklyn, everyone's hate and bigotry smolders and builds until it explodes into violence.","Genre":{"Name":"Comedy","Description":"Comedy films are films designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment."},"Director":{"Name":"Spike Lee","Bio":"Shelton Jackson Spike Lee (born March 20, 1957) is an American film director, producer, screenwriter, actor, and professor. His production company, 40 Acres and a Mule Filmworks, has produced more than 35 films since 1983.","Birth":"1957"},"ImagePath":"dotherightthing.png","Featured":true}
{"_id":{"$oid":"622234928d00cadc928df9be"},"Title":"The Shinning","Description":"A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.","Genre":{"Name":"Horror","Description":"Horror films may incorporate incidents of physical violence and psychological terror; they may be studies of deformed, disturbed, psychotic, or evil characters; stories of terrifying monsters or malevolent animals; or mystery thrillers that use atmosphere to build suspense."},"Director":{"Name":"Stanley Kubrick","Bio":"Famed filmmaker Stanley Kubrick was born in New York City on July 26, 1928, and grew up in the Bronx, New York, where his father, Jacques Kubrick, worked as a doctor and his mother, Sadie (Perveler) Kubrick, was a housewife. He had a younger sister, Barbara. Kubrick never took to the classroom.","Birth":"1928","Death":"1999"},"ImagePath":"theshinning.png","Featured":true}
{"_id":{"$oid":"6222349b8d00cadc928df9bf"},"Title":"Melancholia","Description":"Two sisters find their already strained relationship challenged as a mysterious new planet threatens to collide with Earth.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters."},"Director":{"Name":"Lars von Trier","Bio":"Lars von Trier is a troubled director talking in his movies about troubled topics.","Birth":"1956"},"ImagePath":"melancholia.png","Featured":true}
